Public Types | Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::GraphCalculationInterface Class Referencefinal
MEP Element Manager
A class to communicate between registered calculating addons and those using the calculations. More...
#include <MEPGraphCalculationInterface.hpp>
 Inheritance diagram for ACAPI::MEP::v1::GraphCalculationInterface:
 Public Types
using  | DoCalculationCallback = void(*)(const GS::Guid &, const ACAPI::MEP::v1::DistributionSystemsGraph &)
The signature of the calculation callback.
 using  | CalculationResultData = std::vector< std::tuple< GS::Guid, GS::UniString, std::any > >
The signature of the result data in the form (element guid, column ID, value).
 Public Member Functions
ACAPI::Result< std::shared_ptr< void > >  | RegisterDoCalculationCallback (DoCalculationCallback callback, const std::vector< const ICalculationResultColumn * > &resultColumns)
Registers a callback function for performing calculations.
void  | InvokeCalculationResults (const CalculationResultData &results) const
Invokes the function to deliver calculation results.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< GraphCalculationInterface >  | CreateCalculationInterface ()
Creates an instance of the GraphCalculationInterface.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class to communicate between registered calculating addons and those using the calculations.
When a new calculation needs to be done, the requestor calls a function to invoke a new calculation. When the calculator is finished with it's calculations, it calls a function to return the results to registered result wanters.
Since
Archicad 28
Example code snippets from Test / New MEP
CreateCalculationInterface
 ACAPI::Result<ACAPI::MEP::GraphCalculationInterface> calculationInterface = ACAPI::MEP::CreateCalculationInterface ();
 if (calculationInterface.IsErr ())
 return calculationInterface.UnwrapErr ().kind;
 RegisterDoCalculationCallback
 const auto calculationCallback = [](const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph) {
 Reporter reporter;
 reporter.Add (GS::UniString::Printf ("Calculation callback was called on root element %T!", root.ToUniString ().ToPrintf ()));
 reporter.AddNewLine ();
 reporter.Add (GS::UniString::Printf ("In a graph with %zu systems!", graph.GetSystems ().size ()));
 reporter.AddNewLine ();
 reporter.Write ();
 };
 TestColumn1 testCol1;
 std::vector<const ACAPI::MEP::ICalculationResultColumn*> columnsToShowInBrowser;
 columnsToShowInBrowser.emplace_back (&testCol1);
 ACAPI::Result<std::shared_ptr<void>> registrationResult = calculationInterface->RegisterDoCalculationCallback (calculationCallback, columnsToShowInBrowser);
 if (registrationResult.IsErr ()) {
 reporter.Add (GS::UniString (registrationResult.UnwrapErr ().text));
 return Error;
 }
 std::shared_ptr<void> registeredColumnsScope = registrationResult.Unwrap ();
 InvokeCalculationResults
 std::vector<std::tuple<GS::Guid, GS::UniString, std::any>> changedElements;
 // Generate some random values to display in the system browser:
 auto genRandomNum = [gen = std::default_random_engine {}, dist = std::uniform_real_distribution<> { 0.1, 100.0 }] () mutable
 {
 return dist (gen);
 };
 for (const ACAPI::MEP::UniqueID& element : graphElements) {
 changedElements.emplace_back (element.GetGuid (), testCol1.GetId (), genRandomNum ());
 }
 calculationInterface->InvokeCalculationResults (changedElements);
Member Typedef Documentation
◆ DoCalculationCallback
 using ACAPI::MEP::v1::GraphCalculationInterface::DoCalculationCallback = void (*)(const GS::Guid&, const ACAPI::MEP::v1::DistributionSystemsGraph&)
The signature of the calculation callback.
The callback caller supplies the GUID of the "root element" for the system to perform calculations on, which is an element contained in the system to perform calculations on and also the first element DistributionSystem::TraverseTree will traverse through.
Member Function Documentation
◆ InvokeCalculationResults()
 void ACAPI::MEP::v1::GraphCalculationInterface::InvokeCalculationResults  |  ( |  const CalculationResultData &  |  results | ) |   const
Invokes the function to deliver calculation results.
Parameters
results | A vector of (elemId, column ID and value) objects representing the results of the calculation.
              @snippet GraphCalculationInterface.cpp InvokeCalculationResults_Example
◆ RegisterDoCalculationCallback()
 ACAPI::Result< std::shared_ptr< void > > ACAPI::MEP::v1::GraphCalculationInterface::RegisterDoCalculationCallback  |  ( |  DoCalculationCallback  |  callback,
|  const std::vector< const ICalculationResultColumn * > &  |  resultColumns
)
Registers a callback function for performing calculations.
The callback is invoked every time the system browser requests calculated values, which happens everytime a system becomes visible or changes in the system browser tree view.
Parameters
callback | The function to be called when a calculation needs to be performed.
resultColumns | Implementations of the ICalculationResultColumn interface to integrate values into the Systems Browser.
Returns
A shared_ptr to void used as a guard object. When the return value object goes out of scope, the callback will be ungeristered.
 const auto calculationCallback = [](const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph) {
 Reporter reporter;
 reporter.Add (GS::UniString::Printf ("Calculation callback was called on root element %T!", root.ToUniString ().ToPrintf ()));
 reporter.AddNewLine ();
 reporter.Add (GS::UniString::Printf ("In a graph with %zu systems!", graph.GetSystems ().size ()));
 reporter.AddNewLine ();
 reporter.Write ();
 };
 TestColumn1 testCol1;
 std::vector<const ACAPI::MEP::ICalculationResultColumn*> columnsToShowInBrowser;
 columnsToShowInBrowser.emplace_back (&testCol1);
 ACAPI::Result<std::shared_ptr<void>> registrationResult = calculationInterface->RegisterDoCalculationCallback (calculationCallback, columnsToShowInBrowser);
 if (registrationResult.IsErr ()) {
 reporter.Add (GS::UniString (registrationResult.UnwrapErr ().text));
 return Error;
 }
 std::shared_ptr<void> registeredColumnsScope = registrationResult.Unwrap ();
Friends And Related Symbol Documentation
◆ CreateCalculationInterface
 Result< GraphCalculationInterface > CreateCalculationInterface  |  ( |   | )
friend
Creates an instance of the GraphCalculationInterface.
      This function is used to get the singleton instance of the GraphCalculationInterface.
      It is a friend function of the GraphCalculationInterface class, allowing it to access
      the private members of the class.
Returns
A reference to the GraphCalculationInterface instance.
 ACAPI::Result<ACAPI::MEP::GraphCalculationInterface> calculationInterface = ACAPI::MEP::CreateCalculationInterface ();
 if (calculationInterface.IsErr ())
 return calculationInterface.UnwrapErr ().kind;